sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=4/bench.log
/localhome/local-triv/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=12, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=4, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=4/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=12, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=4, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=4/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 6376
#Output tokens: 5930
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 12/12 [00:31<00:00,  2.63s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 4         
Successful requests:                     12        
Benchmark duration (s):                  31.57     
Total input tokens:                      6376      
Total generated tokens:                  5930      
Total generated tokens (retokenized):    5930      
Request throughput (req/s):              0.38      
Input token throughput (tok/s):          201.99    
Output token throughput (tok/s):         187.86    
Total token throughput (tok/s):          389.85    
Concurrency:                             2.82      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   7405.85   
Median E2E Latency (ms):                 6060.41   
---------------Time to First Token----------------
Mean TTFT (ms):                          114.67    
Median TTFT (ms):                        116.34    
P99 TTFT (ms):                           171.47    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           14.78     
Median ITL (ms):                         11.68     
P95 ITL (ms):                            23.80     
P99 ITL (ms):                            26.25     
Max ITL (ms):                            143.10    
==================================================